
#Область СлужебныйПрограммныйИнтерфейс

// Выполняет анализ результат обработки штрихкода, на основании которого выполняет необходимые действия.
// 
// Параметры:
//  ПараметрыЗавершенияВводаШтрихкода - Структура - (См. ШтрихкодированиеКлиент.ПараметрыЗавершенияОбработкиВводаШтрихкода).
Функция ЗавершитьОбработкуВводаШтрихкода(ПараметрыЗавершенияВводаШтрихкода, ВыполнятьОбработчикОповещения = Истина) Экспорт
	
	ПараметрыСканирования       = ПараметрыЗавершенияВводаШтрихкода.ПараметрыСканирования;
	РезультатОбработкиШтрихкода = ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода;
	Форма                       = ПараметрыЗавершенияВводаШтрихкода.Форма;
	ВидПродукции                = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Обувная");
	
	Если РезультатОбработкиШтрихкода.ТребуетсяАвторизацияИСМП Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("АвторизацияПользователяЗавершение",
			ЭтотОбъект, ПараметрыЗавершенияВводаШтрихкода);
		
		ПараметрыЗапросаКлючаСессии = ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(
			ПараметрыСканирования.Организация);
		ИнтерфейсАвторизацииИСМПКлиент.ЗапроситьКлючСессии(ПараметрыЗапросаКлючаСессии, ОписаниеОповещения);
		Возврат Истина;
		
	КонецЕсли;
	
	Если РезультатОбработкиШтрихкода.ЕстьОшибкиВДеревеУпаковок
		Или РезультатОбработкиШтрихкода.ЕстьОшибки
		Или ЗначениеЗаполнено(РезультатОбработкиШтрихкода.ТекстОшибки) Тогда
		
		ПредставлениеНоменклатуры = НСтр("ru = '<Неизвестная обувная продукция>'");
		Если ЭтоАдресВременногоХранилища(РезультатОбработкиШтрихкода.АдресДанныхШтрихкода) Тогда
			ДанныеШтрихкода = ПолучитьИзВременногоХранилища(РезультатОбработкиШтрихкода.АдресДанныхШтрихкода);
			ПредставлениеНоменклатуры = Строка(ДанныеШтрихкода.Номенклатура);
		КонецЕсли;
		
		ПараметрыОткрытияФормы = ШтрихкодированиеИСКлиент.ПараметрыОткрытияФормыНевозможностиДобавленияОтсканированного(ВидПродукции);
		ПараметрыОткрытияФормы.Штрихкод                  = РезультатОбработкиШтрихкода.Штрихкод;
		ПараметрыОткрытияФормы.ТекстОшибки               = РезультатОбработкиШтрихкода.ТекстОшибки;
		ПараметрыОткрытияФормы.ТипШтрихкода              = РезультатОбработкиШтрихкода.ТипШтрихкода;
		ПараметрыОткрытияФормы.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
		ПараметрыОткрытияФормы.АдресДереваУпаковок       = РезультатОбработкиШтрихкода.АдресДереваУпаковок;
		
		ОткрытьФормуНевозможностиДобавленияОтсканированного(Форма, ПараметрыОткрытияФормы);
		Возврат Истина;
		
	КонецЕсли;
	
	Если РезультатОбработкиШтрихкода.ТребуетсяУточнениеДанных Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"УточненияДанныхЗавершение", ЭтотОбъект, ПараметрыЗавершенияВводаШтрихкода);
		ШтрихкодированиеИСКлиент.УточнитьДанныеУПользователя(
			Форма, РезультатОбработкиШтрихкода.ПараметрыУточненияДанных, ОписаниеОповещения);
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если ВыполнятьОбработчикОповещения И Не (ПараметрыЗавершенияВводаШтрихкода.ОповещениеПриЗавершении = Неопределено) Тогда
		
		ВыполнитьОбработкуОповещения(ПараметрыЗавершенияВводаШтрихкода.ОповещениеПриЗавершении, РезультатОбработкиШтрихкода);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

//Открывает форму, которая информирует пользователя об ошибке добавления введенного штрихкода.
//
Процедура ОткрытьФормуНевозможностиДобавленияОтсканированного(Форма, ПараметрыОткрытияФормы, ОповещениеОЗакрытии = Неопределено) Экспорт
	
	ОткрытьФорму(
		"Обработка.ПроверкаИПодборПродукцииИСМП.Форма.ИнформацияОНевозможностиДобавленияОтсканированного",
		ПараметрыОткрытияФормы, Форма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Проверяет результат обработки штрихкода на необходимость интерактивного уточнения данных у пользователя.
// 
// Параметры:
//  РезультатОбработки - Структура - (См. ШтрихкодированиеИСМП.ИнициализироватьРезультатОбработкиШтрихкода).
// Возвращаемое значение:
//  Булево - Истина, если необходимо уточнить данные у пользователя.
Функция ТребуетсяУточнениеДанныхУПользователя(РезультатОбработки, ПараметрыСканирования) Экспорт
	
	ТребуетсяВыборСерии = РезультатОбработки.ТребуетсяВыборСерии;
	Если ПараметрыСканирования.АдресДанныхДокументаОснования = Неопределено Тогда
		ТребуетсяВыборСерии = Ложь;
	КонецЕсли;
	
	Возврат РезультатОбработки.ТребуетсяАвторизацияИСМП Или ТребуетсяВыборСерии;
	
КонецФункции

// Выполняет повторно вызов клиентских функий обработки штрихкодов в случае успешного прохождения авторизации.
// 
// Параметры:
// 	Результат - Соответствие - содержит информация о необходимости авторизации по организации.
// 	ДополнительныеПараметры - (См. ШтрихкодированиеИСКлиент.ПараметрыЗавершенияОбработкиВводаШтрихкода).
Процедура АвторизацияПользователяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ДополнительныеПараметры.ПараметрыСканирования.Организация;
	
	Если ТипЗнч(Результат[Организация]) = Тип("Строка") Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат[Организация]);
		
		Возврат;
	КонецЕсли;
	
	Если Результат[Организация] = Истина Тогда
		
		Если ДополнительныеПараметры.Свойство("ВызовИзФормыДокумента") Тогда
			
			Если ДополнительныеПараметры.ВызовИзФормыДокумента Тогда
				
				Форма                   = ДополнительныеПараметры.Форма;
				ДанныеШтрихкода         = ДополнительныеПараметры.ДанныеШтрихкода;
				КэшированныеЗначения    = ДополнительныеПараметры.КэшированныеЗначения;
				ОповещениеПриЗавершении = ДополнительныеПараметры.ОповещениеПриЗавершении;
				
				ШтрихкодированиеИСКлиент.ОбработатьВводШтрихкода(Форма, ДанныеШтрихкода, КэшированныеЗначения,,ОповещениеПриЗавершении);
				
			Иначе
				
				Форма                   = ДополнительныеПараметры.Форма;
				ОповещениеПриЗавершении = ДополнительныеПараметры.ОповещениеПриЗавершении;
				ДанныеШтрихкода         = ДополнительныеПараметры.ДанныеШтрихкода;
				ПараметрыСканирования   = ДополнительныеПараметры.ПараметрыСканирования;
				
				ШтрихкодированиеИСКлиент.ОбработатьДанныеШтрихкода(
					ОповещениеПриЗавершении, Форма, ДанныеШтрихкода, ПараметрыСканирования);
			КонецЕсли;
			
		Иначе
			
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОбработкиШтрихкода, ДополнительныеПараметры.ДанныеШтрихкода);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Выполняет действия после выбора серии пользователем.
//
//Параметры:
//   РезультатВыбора        - ОпределяемыйТип.СерияНоменклатуры - выбранная серия.
//  ДополнительныеПараметры - Структура - данные источника вызова
//
Процедура УточненияДанныхЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВыбора) Тогда
		
		Если ДополнительныеПараметры.Свойство("ОповещениеПриЗавершении") Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении);
		Иначе
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗавершениеОбработки);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если ДополнительныеПараметры.Свойство("ВызовИзФормыДокумента") Тогда
		Если ДополнительныеПараметры.ВызовИзФормыДокумента Тогда

			Действие = "ОбработатьВыборСерии";
			РезультатОбработкиШтрихкода = Форма.Подключаемый_ВыполнитьДействие(
				Действие,
				РезультатВыбора,
				ДополнительныеПараметры.РезультатОбработкиШтрихкода,
				ДополнительныеПараметры.КэшированныеЗначения);

			ПараметрыЗавершенияВводаШтрихкода = ШтрихкодированиеИСКлиент.ПараметрыЗавершенияОбработкиВводаШтрихкода();
			ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода = РезультатОбработкиШтрихкода;
			ПараметрыЗавершенияВводаШтрихкода.КэшированныеЗначения        = ДополнительныеПараметры.КэшированныеЗначения;
			ПараметрыЗавершенияВводаШтрихкода.Форма                       = Форма;
			ДополнительныеПараметры.Свойство("ОповещениеПриЗавершении", ПараметрыЗавершенияВводаШтрихкода.ОповещениеПриЗавершении);
			ЗавершитьОбработкуВводаШтрихкода(ПараметрыЗавершенияВводаШтрихкода);

		Иначе

			ДанныеШтрихкода = ШтрихкодированиеИСВызовСервера.ОбработатьДанныеШтрихкодаПослеВыбораСерии(
				ДополнительныеПараметры.РезультатОбработкиШтрихкода, РезультатВыбора);

			ШтрихкодированиеИСМПКлиентСервер.ОбработатьСохраненныйВыборДанныхПоМаркируемойПродукции(Форма, ДанныеШтрихкода);

			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, ДанныеШтрихкода);

		КонецЕсли;
		
	Иначе

		РезультатУточнения = Новый Структура;
		РезультатУточнения.Вставить("РезультатВыбора",             РезультатВыбора);
		РезультатУточнения.Вставить("КэшированныеЗначения",        ДополнительныеПараметры.КэшированныеЗначения);
		РезультатУточнения.Вставить("ПараметрыСканирования",       ДополнительныеПараметры.ПараметрыСканирования);
		РезультатУточнения.Вставить("Действие",                    "ОбработатьУточнениеДанных");
		РезультатУточнения.Вставить("РезультатОбработкиШтрихкода", ДополнительныеПараметры.РезультатОбработкиШтрихкода);
		РезультатУточнения.Вставить("ИсходныеДанные",              ДополнительныеПараметры.ДанныеШтрихкода);
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеВыполнитьДействие, РезультатУточнения);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
