#Область СлужебныйПрограммныйИнтерфейс

// Возвращает дату обязательной маркировки табачных изделий.
// 
// Параметры:
// Возвращаемое значение:
// 	Дата - дата обязательной маркировки табачных изделий.
//
Функция ДатаОбязательнойМаркировкиТабачнойПродукции() Экспорт
	
	Возврат Константы.ДатаОбязательнойМаркировкиТабачнойПродукцииМОТП.Получить();

КонецФункции

Функция ИспользуетсяРегистрацияРозничныхПродажМОТП(Знач ДатаПродажи) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ВестиУчетТабачнойПродукцииМОТП") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ДатаПродажи >= Константы.ДатаОбязательнойМаркировкиТабачнойПродукцииМОТП.Получить();
	
КонецФункции

// Возвращает признак необходимости контроля статусов кодов маркировок МОТП.
// 
// Параметры:
// Возвращаемое значение:
// 	Булево - Истина, в случае необходимости контроля статусов.
//
Функция КонтролироватьСтатусыКодовМаркировки() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("КонтролироватьСтатусыКодовМаркировкиМОТП");
	
КонецФункции

// Возвращает признак необходимости контроля статусов кодов маркировок при розничной торговле.
// 
// Параметры:
// Возвращаемое значение:
// 	Булево - Истина, в случае необходимости контроля статусов.
//
Функция КонтролироватьСтатусыКодовМаркировкиВРознице() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("КонтролироватьСтатусыКодовМаркировкиВРозницеМОТП");
	
КонецФункции

// Проверяет на тестовый период текущую дату сеанса.
// 
// Возвращаемое значение:
//  Булево - Истина, если текущая дата сеанса находится в тестовом периоде.
Функция ЭтоТестовыйПериод() Экспорт
	
	ЭтоТестовыйПериод = ПолучитьФункциональнуюОпцию("ВестиУчетТабачнойПродукцииМОТП")
		И ДатаОбязательнойМаркировкиТабачнойПродукции() > НачалоДня(ТекущаяДатаСеанса());
	
	Возврат ЭтоТестовыйПериод;
	
КонецФункции

#КонецОбласти