
#Область СлужебныйПрограммныйИнтерфейс

#Область Выгрузка

Процедура ВыгрузитьВФайлУведомлениеПоПрослеживаемости(Ссылка) Экспорт

	РезультатВыгрузки = ПрослеживаемостьВызовСервера.ПолучитьВыгружаемыеДанныеУведомленияПоПрослеживаемости(Ссылка);

	Если РезультатВыгрузки <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатВыгрузки.Ошибки) Тогда
		
			Сообщение = Новый СообщениеПользователю;
		
			Для каждого ТекущаяОшибка Из РезультатВыгрузки.Ошибки Цикл
			
				Сообщение.Текст = ТекущаяОшибка;
				Сообщение.Сообщить();
			
			КонецЦикла;
		Иначе
			
			ВыгрузитьУведомлениеВXML(РезультатВыгрузки);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыгрузитьУведомлениеВXML(РезультатВыгрузки)
	
	Попытка
			
		ПолучитьФайл(РезультатВыгрузки.АдресФайлаВыгрузки, РезультатВыгрузки.ИмяФайлаВыгрузки, Истина);
			
	Исключение
			
		Сообщение = Новый СообщениеПользователю;
			
		ТекстСообщения = "Не удалось записать файл """ + РезультатВыгрузки.ИмяФайлаВыгрузки 
		+ """! Возможно, недостаточно места на диске или диск защищен от записи.";
		
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), ТекстСообщения);
		
		Сообщение.Сообщить();
			
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
