////////////////////////////////////////////////////////////////////////////////
// Модуль содержит реализацию методов работы с метаданными конфигурации.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ПроверкаРеквизитов

// Позволяет определить есть ли среди реквизитов объекта
// реквизит с переданным именем.
// 
// Параметры:
//  ИмяРеквизита - строковое имя искомого реквизита.
//  МетаОбъект   - объект описания метаданных, среди реквизитов которого производится поиск.
// 
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
// 
Функция ЕстьРеквизит(ИмяРеквизита, МетаОбъект) Экспорт

	Возврат бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, МетаОбъект);

КонецФункции // ЕстьРеквизит()

#КонецОбласти

#Область ПодборСправочников

// Функция получает пустую ссылку справочника Банковских счетов.
// 
// Возвращаемое значение:
//   Строка
// 
Функция ПолучитьПустуюСсылку_СправочникБС() Экспорт
    
    МассивИмен = Новый Массив;
    МассивИмен.Добавить("БанковскиеСчета");
    МассивИмен.Добавить("БанковскиеСчетаОрганизаций");
    
    СправочникПустаяСсылка = ПолучитьПустуюСсылкуСправочника_ПроверкаМетаданных(МассивИмен);
    
    Возврат СправочникПустаяСсылка;
	
КонецФункции // ПолучитьПустуюСсылку_СправочникБС()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
// Функция получает пустую ссылку справочника.
// 
// Возвращаемое значение:
//   МассивИмен - Массив.
// 
Функция ПолучитьПустуюСсылкуСправочника_ПроверкаМетаданных(МассивИмен)
    
    СправочникПустаяСсылка = Неопределено;
    
    Для каждого ИмяСправочника Из МассивИмен Цикл
    
        Если бит_РаботаСМетаданными.ЕстьСправочник(ИмяСправочника) Тогда
	
    		СправочникПустаяСсылка = Справочники[ИмяСправочника].ПустаяСсылка();	
    	    Прервать;
            
    	КонецЕсли;	
    
    КонецЦикла;   	 
	
	Возврат СправочникПустаяСсылка;
	
КонецФункции // ПолучитьПустуюСсылкуСправочника_ПроверкаМетаданных()

#КонецОбласти
