#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВыгружаемыеДанныеУведомленияПоПрослеживаемости(Ссылка) Экспорт

	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.УведомлениеОбОстаткахПрослеживаемыхТоваров") Тогда
		Возврат 
			Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров.ВыгрузитьУведомлениеОбОстаткахПрослеживаемыхТоваров(Ссылка);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров") Тогда
		Возврат 
			Документы.УведомлениеОВвозеПрослеживаемыхТоваров.ВыгрузитьУведомлениеОВвозеПрослеживаемыхТоваров(Ссылка);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.УведомлениеОПеремещенииПрослеживаемыхТоваров") Тогда
		Возврат 
			Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров.ВыгрузитьУведомлениеОПеремещенииПрослеживаемыхТоваров(Ссылка);
		
	КонецЕсли;
		
	Возврат Неопределено;

КонецФункции

Функция МожноДобавлятьУведомленияОПеремещении() Экспорт
	
	Возврат ПравоДоступа("Добавление", Метаданные.Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров);

КонецФункции

#КонецОбласти
