
#Область ПрограммныйИнтерфейс
 
// Процедура добавляет в список вид договора с указанным именем, при условии,
//  что в структуре ВидыДоговоров существет значение с заданным именем. Данная проверка актуальна,
//  т.к. в УПП/КА и БП состав значений перечисления ВидыДоговоров различный.
//
// Параметры:
//  СписокВидыДоговоров	 - Массив - Список видов договоров.
//  ВидыДоговоров		 - Структура - Виды договоров.
//  ИмяВидаДоговора		 - Строка - Имя вида договора.
//
Процедура ДобавитьВидДоговора(СписокВидыДоговоров, ВидыДоговоров, ИмяВидаДоговора) Экспорт

	Если ВидыДоговоров.Свойство(ИмяВидаДоговора) Тогда
	
		 СписокВидыДоговоров.Добавить(ВидыДоговоров[ИмяВидаДоговора]);
	
	КонецЕсли; 

КонецПроцедуры // ДобавитьВидДоговора()

// Выполняется проверка принадлежности вида договора к определенному значению.
// 
// Параметры:
// 	ВидДоговора - ПеречислениеСсылка.ВидыДоговоровКонтрагентов - текущее значение, которое требуется проверить
// 	ВидыДоговоров - Структура - закэшированные значения перечисления ВидыДоговоровКонтрагентов
// 	ИмяВидаДоговора - Строка - значение, на равенство которому надо проверить.
// 
// Возвращаемое значение:
// 	Результат - булево.
// 
Функция ПроверитьВидДоговора(ВидДоговора, ВидыДоговоров, ИмяВидаДоговора) Экспорт
	
	Если ВидыДоговоров.Свойство(ИмяВидаДоговора) Тогда
		Результат = ?(ВидДоговора = ВидыДоговоров[ИмяВидаДоговора], Истина, Ложь);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция вычисляет дату от периода действия договора.
//
// Параметры:
//  Договор	 - СправочникСсылка	 - договор контрагента.
//  ВидДаты	 - Строка	 - вид даты.
// 
// Возвращаемое значение:
//  Результат - Дата.
//
Функция ПериодДействияПроектаДоговора(Договор, ВидДаты) Экспорт

	ДатаДоговора = Дата(1,1,1);
	
	// ++БП
	Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
    	Если ВидДаты = "ДатаОт" Тогда
			ДатаДоговора = Формат(Договор.Дата, "ДФ=dd.MM.yyyy");
		ИначеЕсли ВидДаты = "ДатаДо" Тогда
			ДатаДоговора = Формат(Договор.СрокДействия, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
	Иначе
		
		ПериодДействия = бит_ДоговораСервер.ВычислитьКонтрольныеДатыПоПроектам(Договор);	

		Если ВидДаты = "ДатаОт" Тогда
			ДатаДоговора = Формат(ПериодДействия.ДатаОт, "ДФ=dd.MM.yyyy");
		ИначеЕсли ВидДаты = "ДатаДо" Тогда
			ДатаДоговора = Формат(ПериодДействия.ДатаДо, "ДФ=dd.MM.yyyy");
		КонецЕсли;
    		        
    КонецЕсли;
	// --БП
	
	Возврат ДатаДоговора;
	
КонецФункции // ПериодДействияПроектаДоговора()

#КонецОбласти
