#Область СлужебныйПрограммныйИнтерфейс

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.Выплаты") Тогда
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d9f73282-98d4-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ВедомостьНаВыплатуЗарплаты);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.КадровыйУчет") Тогда
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf68-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.КадровыйПеревод);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4f7-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПриемНаРаботу);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfba-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.Увольнение);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.ОтражениеЗарплатыВБухгалтерскомУчете") Тогда
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfbb-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ОтражениеЗарплатыВБухучете);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.РасчетЗарплаты") Тогда
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf58-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.БольничныйЛист);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfe4-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ИсполнительныйЛист);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4d4-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.НачислениеЗарплаты);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf4c-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.Отпуск);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfd3-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ОтпускБезСохраненияОплаты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.Выплаты") Тогда
		МодульВыплатаЗарплатыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("ВыплатаЗарплатыДляНебольшихОрганизаций");
		МодульВыплатаЗарплатыДляНебольшихОрганизаций.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.КадровыйУчет") Тогда
		МодульКадровыйУчетДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("КадровыйУчетДляНебольшихОрганизаций");
		МодульКадровыйУчетДляНебольшихОрганизаций.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.ОтражениеЗарплатыВБухгалтерскомУчете") Тогда
		МодульОтражениеЗарплатыВБухучетеДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("ОтражениеЗарплатыВБухучетеДляНебольшихОрганизаций");
		МодульОтражениеЗарплатыВБухучетеДляНебольшихОрганизаций.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.РасчетЗарплаты") Тогда
		МодульРасчетЗарплатыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("РасчетЗарплатыДляНебольшихОрганизаций");
		МодульРасчетЗарплатыДляНебольшихОрганизаций.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// См. ОбщегоНазначенияПереопределяемый.ЗаполнитьТаблицуПереименованияОбъектовМетаданных.
Процедура ЗаполнитьТаблицуПереименованияОбъектовМетаданных(Итог) Экспорт

	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.1.10.26",
		"Подсистема.ЗарплатаКадрыПодсистемы.Подсистема.ОбъектыБазовойРеализации",
		"Подсистема.ЗарплатаКадрыПриложения.Подсистема.ЗарплатаКадрыДляНебольшихОрганизаций.Подсистема.Выплаты",
		"ЗарплатаКадрыБазовая");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.1.10.26",
		"Подсистема.ЗарплатаКадрыПриложения.Подсистема.КадровыйУчетБазовый",
		"Подсистема.ЗарплатаКадрыПриложения.Подсистема.ЗарплатаКадрыДляНебольшихОрганизаций.Подсистема.КадровыйУчет",
		"ЗарплатаКадрыБазовая");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.1.10.26",
		"Подсистема.ЗарплатаКадрыПриложения.Подсистема.БухгалтерскийУчетБазовый",
		"Подсистема.ЗарплатаКадрыПриложения.Подсистема.ЗарплатаКадрыДляНебольшихОрганизаций.Подсистема.ОтражениеЗарплатыВБухгалтерскомУчете",
		"ЗарплатаКадрыБазовая");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.1.10.26",
		"Подсистема.ЗарплатаКадрыПриложения.Подсистема.РасчетЗарплатыДляНебольшихОрганизаций",
		"Подсистема.ЗарплатаКадрыПриложения.Подсистема.ЗарплатаКадрыДляНебольшихОрганизаций.Подсистема.РасчетЗарплаты",
		"ЗарплатаКадрыБазовая");
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ЗаполнитьСведенияОПерсональныхДанных.
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	ВыплатаЗарплатыДляНебольшихОрганизаций.ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений);
	РасчетЗарплатыДляНебольшихОрганизаций.ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений);
	
КонецПроцедуры

#КонецОбласти
