
#Область СлужебныйПрограммныйИнтерфейс
	
// Функция.
// 
// Параметры:
// 
// 
// Возвращаемое значение:
//  Результат - Строка.
// 
Функция ИзвлечьДанныеПоляHTTP(ТекстЗапросаПоле, НастройкаПодключения) Экспорт
	
	Путь = НастройкаПодключения.ИмяСервера+"/"+НастройкаПодключения.ИмяБазы;	
	
	СоединениеHTTP = Новый HTTPСоединение(Путь,,НастройкаПодключения.Пользователь,НастройкаПодключения.Пароль);
	
	ЗапросHTTP = Новый HTTPЗапрос(ТекстЗапросаПоле);
	
	ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);
	
	СтрОтвет = ОтветHTTP.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(СтрОтвет);
	
	РезДанные = Новый Массив;
	ТекЭл = Неопределено;
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента 
			И Чтение.Имя = "m:properties" Тогда
			
			ТекЭлемент = Новый Структура;
			
		КонецЕсли; 
		
		Если НЕ ТекЭлемент = Неопределено Тогда
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента 
				И Найти(Чтение.Имя, "d:")>0 Тогда
				
				ИмяПоля = СтрЗаменить(Чтение.Имя, "d:","");
				Если ВРег(ИмяПоля) = ВРег("Ref_Key") Тогда
					
					ИмяПоля = "ИД";	
					
				КонецЕсли; 
				флУстановитьЗначение = Истина;
				
			КонецЕсли; 
			
			Если Чтение.ТипУзла = ТипУзлаXML.Текст 
				И флУстановитьЗначение 
				И ЗначениеЗаполнено(ИмяПоля)  Тогда
				
				ТекЭлемент.Вставить(ИмяПоля, Чтение.Значение);
				флУстановитьЗначение = Ложь;
				
			КонецЕсли;
			
			Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента 
				И Чтение.Имя = "m:properties" Тогда
				
				РезДанные.Добавить(ТекЭлемент);
				ТекЭлемент = Неопределено;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла;  // Чтение XML
	
	Возврат РезДанные;
	
КонецФункции // ИзвлечьДанныеПоляHTTP()

// Функция.
// 
// Параметры:
// 
// 
// Возвращаемое значение:
//  Результат - Строка.
// 
Функция ИзвлечьДанныеИсточникаHTTP(ТекстЗапроса, НастройкаПодключения) Экспорт

	Путь = НастройкаПодключения.ИмяСервера+"/"+НастройкаПодключения.ИмяБазы;		
	
	СоединениеHTTP = Новый HTTPСоединение(Путь,,НастройкаПодключения.Пользователь,НастройкаПодключения.Пароль);
	
	ЗапросHTTP = Новый HTTPЗапрос(ТекстЗапроса);
	
	ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);
	
	СтрОтвет = ОтветHTTP.ПолучитьТелоКакСтроку();

	Возврат СтрОтвет;
	
КонецФункции // ИзвлечьДанныеИсточникаHTTP()

#КонецОбласти
