// Содержимое модуля отличается в версиях ПРОФ и КОРП

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработкаВыбора(Форма, ВыбранноеЗначение, ИсточникВыбора, СпособОценки) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	Объект.ГрафикПлатежей.Очистить();
	Для ИндексСтроки = 0 По ВыбранноеЗначение.Даты.ВГраница() Цикл
		НоваяСтрока = Объект.ГрафикПлатежей.Добавить();
		НоваяСтрока.ДатаПлатежа = ВыбранноеЗначение.Даты[ИндексСтроки];
		НоваяСтрока.СуммаПлатежа = ВыбранноеЗначение.Суммы[ИндексСтроки];
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
	ПроцентыПоОбязательствамФормыКлиентСервер.СформироватьНадписьГрафикПлатежей(Форма, СпособОценки);
	
КонецПроцедуры

Процедура ПолучитьПараметрыФормыГрафикПлатежейДляАренды(Форма, ПараметрыФормы) Экспорт
	
	Если Не Форма.ПроверитьДатуОкончанияАренды() Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	ПараметрыФормы = ГрафикПлатежейПараметрыФормыОбщие(Форма);
	ПараметрыФормы.Вставить("ДатаОкончания", Объект.ДатаОкончанияАренды);
	
КонецПроцедуры

Процедура ПолучитьПараметрыФормыГрафикПлатежейДляРассрочки(Форма, ПараметрыФормы) Экспорт
	
	ПараметрыФормы = ГрафикПлатежейПараметрыФормыОбщие(Форма);
	ПараметрыФормы.Вставить("ЭтоРассрочка", Истина);
	
КонецПроцедуры

Процедура НадписьГрафикПлатежейНажатие(Форма, СтандартнаяОбработка, ПараметрыФормы) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ПараметрыФормы) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ГрафикПлатежейПоДоговору.Форма", ПараметрыФормы, Форма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ГрафикПлатежейПараметрыФормыОбщие(Форма)
	
	Объект = Форма.Объект;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаДокумента", Объект.Дата);
	ПараметрыФормы.Вставить("Даты", Новый Массив);
	ПараметрыФормы.Вставить("Суммы", Новый Массив);
	Для Каждого СтрокаТаблицы Из Объект.ГрафикПлатежей Цикл
		ПараметрыФормы.Даты.Добавить(СтрокаТаблицы.ДатаПлатежа);
		ПараметрыФормы.Суммы.Добавить(СтрокаТаблицы.СуммаПлатежа);
	КонецЦикла;
	
	ПараметрыФормы.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	
	Возврат ПараметрыФормы;
	
КонецФункции

#КонецОбласти
