
//////////////////////////////////////////////////////////////////////////////////////////////
// 1С - ТАКСКОМ

//////////////////////////////////////////////////////////////////////////////////////////////
// Функции и процедуры выполняемые в клиетских модулях

// Возвращаемое значение - Булево (Истина - уведомление сформировано, иначе Ложь)
&НаКлиенте
Функция СформироватьПодписатьЭДУведомлениеОбУточнении(ОбъектСсылка, ТекстУточнения) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Возвращаемое значение - Булево (Истина - извещение сформировано, иначе Ложь)
&НаКлиенте
Функция СформироватьПодписатьЭДИзвещениеОПолучении(МассивЭД) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Возвращаемое значение - Число (количество обработанных документов)
&НаКлиенте
Функция ОбработатьДвоичныеДанныеПакетаСОС(ПакетЭД, ДанныеРаспаковки, ПапкаДляРаспаковки, 
																	ПапкаДляРасшифровки, ЕстьКриптосредствоНаКлиенте, ТипДанных) Экспорт

	Возврат 0;
	
КонецФункции


//////////////////////////////////////////////////////////////////////////////////////////////
// Функции и процедуры выполняемые в серверных модулях

// Возвращаемое значение - Булево (Истина - извещение сформировано, иначе Ложь)
&НаСервере
Функция СформироватьЭДПрисоединенныйФайлПакетаСОС(ТекСтрокаПЭД) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Возвращаемое значение - Число (количество отправленных документов)
&НаСервере
Функция ОтправитьЧерезСОС(ПакетЭД, АдресКаталогаОтправки, ПарольКСертификатуОператора) Экспорт
	
	Возврат 0;
	
КонецФункции

// Возвращаемое значение - Структура с данными, либо Неопределено
&НаСервере
Функция ВернутьМассивДвоичныхДанныхПакетаСОС(ПакетЭД, ПапкаДляРаспаковки, ПараметрыШифрования) Экспорт

	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ПолучитьНовыеЭД_СОС(СтруктураВозврата) Экспорт

	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыДокументовПакетаЭДСОС(ПакетЭД, НовыйСтатусПакета, ДатаИзменения) Экспорт
	
	
	
КонецПроцедуры
