////////////////////////////////////////////////////////////////////////////////
// Даты запрета изменения: расширение функционал подсистемы БСП.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. ДатыЗапретаИзмененияПереопределяемый.ПередПроверкойЗапретаИзменения()
//  Проверяет дополнительное свойство объекта с ключом ОтключитьПроверкуДатыЗапретаИзменения.
//  Если значение свойства Истина, то проверка даты запрета изменения не производится.
//
Процедура ПередПроверкойЗапретаИзменения(Объект, ПроверкаЗапретаИзменения, УзелПланаОбмена, ВерсияОбъекта) Экспорт
	
	Если Объект.ДополнительныеСвойства.Свойство("ОтключитьПроверкуДатыЗапретаИзменения")
		И Объект.ДополнительныеСвойства.ОтключитьПроверкуДатыЗапретаИзменения Тогда
		
		ПроверкаЗапретаИзменения = Ложь;
		УзелПроверкиЗапретаЗагрузки = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
