
Функция СформироватьТаблицуЗакрытия(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	бит_ОборотыПоБюджетамОбороты.Сценарий,
	                      |	бит_ОборотыПоБюджетамОбороты.ЦФО,
	                      |	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов,
	                      |	ВЫРАЗИТЬ(бит_ОборотыПоБюджетамОбороты.Аналитика_1 КАК Документ.бит_ФормаВводаБюджета) КАК Аналитика_1,
	                      |	ВЫРАЗИТЬ(бит_ОборотыПоБюджетамОбороты.Аналитика_2 КАК Справочник.ОбъектыСтроительства) КАК Аналитика_2,
	                      |	СУММА(бит_ОборотыПоБюджетамОбороты.СуммаБезНДСРеглОборот) КАК СуммаБезНДСРеглОборот,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА бит_ОборотыПоБюджетамОбороты.Аналитика_3 = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВариантыБюджета.ВРамкахБюджета)
	                      |				ТОГДА бит_ОборотыПоБюджетамОбороты.СуммаБезНДСРеглОборот
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК СуммаБезНДСВРамкахБюджета,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА бит_ОборотыПоБюджетамОбороты.Аналитика_3 = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВариантыБюджета.ЗаРамкамиБюджета)
	                      |				ТОГДА бит_ОборотыПоБюджетамОбороты.СуммаБезНДСРеглОборот
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК СуммаБезНДСЗаРамкамиБюджета,
	                      |	НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, МЕСЯЦ) КАК Период,
	                      |	СУММА(бит_ОборотыПоБюджетамОбороты.СуммаРеглОборот) КАК СуммаРеглОборот,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА бит_ОборотыПоБюджетамОбороты.Аналитика_3 = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВариантыБюджета.ВРамкахБюджета)
	                      |				ТОГДА бит_ОборотыПоБюджетамОбороты.СуммаРеглОборот
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК СуммаВРамкахБюджета,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА бит_ОборотыПоБюджетамОбороты.Аналитика_3 = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВариантыБюджета.ЗаРамкамиБюджета)
	                      |				ТОГДА бит_ОборотыПоБюджетамОбороты.СуммаРеглОборот
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК СуммаЗаРамкамиБюджета,
	                      |	МАКСИМУМ(бит_ОборотыПоБюджетам.бит_БК_Организация) КАК бит_БК_Организация,
	                      |	бит_ОборотыПоБюджетамОбороты.Проект,
	                      |	МАКСИМУМ(бит_ОборотыПоБюджетам.СтавкаНДС) КАК СтавкаНДС
	                      |ПОМЕСТИТЬ Обороты
	                      |ИЗ
	                      |	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	                      |			,
	                      |			,
	                      |			Запись,
	                      |			Сценарий В (&СценарииОбороты)
	                      |				И Аналитика_1 = &Аналитика_1) КАК бит_ОборотыПоБюджетамОбороты
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ОборотыПоБюджетам КАК бит_ОборотыПоБюджетам
	                      |		ПО бит_ОборотыПоБюджетамОбороты.Регистратор = бит_ОборотыПоБюджетам.Регистратор
	                      |			И бит_ОборотыПоБюджетамОбороты.НомерСтроки = бит_ОборотыПоБюджетам.НомерСтроки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	бит_ОборотыПоБюджетамОбороты.Сценарий,
	                      |	бит_ОборотыПоБюджетамОбороты.Аналитика_2,
	                      |	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов,
	                      |	бит_ОборотыПоБюджетамОбороты.ЦФО,
	                      |	бит_ОборотыПоБюджетамОбороты.Аналитика_1,
	                      |	бит_ОборотыПоБюджетамОбороты.Проект,
	                      |	НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, МЕСЯЦ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	СУММА(ЕСТЬNULL(КонтрольныеЗначения.СуммаСценарийКонтрольОборот, 0) - ЕСТЬNULL(КонтрольныеЗначения.СуммаСценарийИсполнениеОборот, 0)) КАК Остаток,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА КонтрольныеЗначения.Аналитика_3 = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВариантыБюджета.ВРамкахБюджета)
	                      |				ТОГДА ЕСТЬNULL(КонтрольныеЗначения.СуммаСценарийКонтрольОборот, 0) - ЕСТЬNULL(КонтрольныеЗначения.СуммаСценарийИсполнениеОборот, 0)
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК ОстатокВРамкахБюджета,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА КонтрольныеЗначения.Аналитика_3 = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВариантыБюджета.ЗаРамкамиБюджета)
	                      |				ТОГДА ЕСТЬNULL(КонтрольныеЗначения.СуммаСценарийКонтрольОборот, 0) - ЕСТЬNULL(КонтрольныеЗначения.СуммаСценарийИсполнениеОборот, 0)
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК ОстатокЗаРамкамиБюджета,
	                      |	КонтрольныеЗначения.Сценарий КАК Сценарий,
	                      |	КонтрольныеЗначения.СтатьяОборотов КАК СтатьяОборотов,
	                      |	КонтрольныеЗначения.ЦФО,
	                      |	КонтрольныеЗначения.Проект,
	                      |	КонтрольныеЗначения.Аналитика_1,
	                      |	КонтрольныеЗначения.Аналитика_2,
	                      |	НАЧАЛОПЕРИОДА(КонтрольныеЗначения.Период, МЕСЯЦ) КАК Период
	                      |ПОМЕСТИТЬ ТаблицаОстаток
	                      |ИЗ
	                      |	РегистрНакопления.бит_КонтрольныеЗначенияБюджетов.Обороты(
	                      |			,
	                      |			,
	                      |			Регистратор,
	                      |			СценарийКонтролируемый В (&СценарииФакт)
	                      |				И Аналитика_1 = &Аналитика_1) КАК КонтрольныеЗначения
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	КонтрольныеЗначения.Сценарий,
	                      |	КонтрольныеЗначения.СтатьяОборотов,
	                      |	КонтрольныеЗначения.ЦФО,
	                      |	КонтрольныеЗначения.Проект,
	                      |	КонтрольныеЗначения.Аналитика_1,
	                      |	КонтрольныеЗначения.Аналитика_2,
	                      |	НАЧАЛОПЕРИОДА(КонтрольныеЗначения.Период, МЕСЯЦ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	бит_ОборотыПоБюджетамОбороты.Сценарий,
	                      |	бит_ОборотыПоБюджетамОбороты.ЦФО,
	                      |	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов,
	                      |	ВЫБОР
	                      |		КОГДА бит_ОборотыПоБюджетамОбороты.Регистратор ССЫЛКА Документ.бит_БК_РазнесениеОборотов
	                      |			ТОГДА бит_ОборотыПоБюджетамОбороты.Аналитика_1
	                      |		ИНАЧЕ бит_КонтрольныеЗначенияБюджетовОбороты.Аналитика_1
	                      |	КОНЕЦ КАК Аналитика_1,
	                      |	бит_ОборотыПоБюджетамОбороты.Аналитика_2,
	                      |	СУММА(бит_ОборотыПоБюджетамОбороты.СуммаБезНДСРеглОборот) КАК СуммаБезНДСРеглОборот,
	                      |	СУММА(бит_ОборотыПоБюджетамОбороты.СуммаРеглОборот) КАК СуммаРеглОборот,
	                      |	бит_ОборотыПоБюджетамОбороты.Проект,
	                      |	НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, МЕСЯЦ) КАК Период
	                      |ПОМЕСТИТЬ ОборотыФакт
	                      |ИЗ
	                      |	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	                      |			,
	                      |			,
	                      |			Регистратор,
	                      |			Сценарий В (&СценарииФакт)
	                      |				И Аналитика_1 = &Аналитика_1) КАК бит_ОборотыПоБюджетамОбороты
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_КонтрольныеЗначенияБюджетов.Обороты(, , Регистратор, СценарийКонтролируемый В (&СценарииФакт)) КАК бит_КонтрольныеЗначенияБюджетовОбороты
	                      |		ПО бит_ОборотыПоБюджетамОбороты.Регистратор = бит_КонтрольныеЗначенияБюджетовОбороты.Регистратор
	                      |			И бит_ОборотыПоБюджетамОбороты.ЦФО = бит_КонтрольныеЗначенияБюджетовОбороты.ЦФО
	                      |			И бит_ОборотыПоБюджетамОбороты.СтатьяОборотов = бит_КонтрольныеЗначенияБюджетовОбороты.СтатьяОборотов
	                      |			И бит_ОборотыПоБюджетамОбороты.Проект = бит_КонтрольныеЗначенияБюджетовОбороты.Проект
	                      |			И бит_ОборотыПоБюджетамОбороты.Аналитика_2 = бит_КонтрольныеЗначенияБюджетовОбороты.Аналитика_2
	                      |			И бит_ОборотыПоБюджетамОбороты.Период = бит_КонтрольныеЗначенияБюджетовОбороты.Период
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	бит_ОборотыПоБюджетамОбороты.Аналитика_2,
	                      |	бит_ОборотыПоБюджетамОбороты.Сценарий,
	                      |	бит_ОборотыПоБюджетамОбороты.ЦФО,
	                      |	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов,
	                      |	бит_ОборотыПоБюджетамОбороты.Проект,
	                      |	ВЫБОР
	                      |		КОГДА бит_ОборотыПоБюджетамОбороты.Регистратор ССЫЛКА Документ.бит_БК_РазнесениеОборотов
	                      |			ТОГДА бит_ОборотыПоБюджетамОбороты.Аналитика_1
	                      |		ИНАЧЕ бит_КонтрольныеЗначенияБюджетовОбороты.Аналитика_1
	                      |	КОНЕЦ,
	                      |	НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, МЕСЯЦ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Период,
	                      |	Обороты.Сценарий КАК Сценарий,
	                      |	Обороты.ЦФО КАК ЦФО,
	                      |	Обороты.СтатьяОборотов КАК СтатьяОборотов,
	                      |	Обороты.Аналитика_1 КАК Аналитика_1,
	                      |	Обороты.Аналитика_2 КАК Аналитика_2,
	                      |	СУММА(ЕСТЬNULL(Обороты.СуммаБезНДСРеглОборот, 0) - ЕСТЬNULL(ОборотыФакт.СуммаБезНДСРеглОборот, 0)) КАК СуммаОстаток,
	                      |	СУММА(Обороты.СуммаБезНДСВРамкахБюджета) КАК СуммаВРамкахБюджета,
	                      |	СУММА(Обороты.СуммаБезНДСЗаРамкамиБюджета) КАК СуммаЗаРамкамиБюджета,
	                      |	СУММА(ЕСТЬNULL(Обороты.СуммаРеглОборот, 0) - ЕСТЬNULL(ОборотыФакт.СуммаРеглОборот, 0)) КАК СуммаСНДСОстаток,
	                      |	СУММА(Обороты.СуммаВРамкахБюджета) КАК СуммаСНДСВРамкахБюджета,
	                      |	СУММА(Обороты.СуммаЗаРамкамиБюджета) КАК СуммаСНДСЗаРамкамиБюджета,
	                      |	МАКСИМУМ(Обороты.бит_БК_Организация) КАК бит_БК_Организация,
	                      |	Обороты.Проект КАК Проект,
	                      |	СУММА(Обороты.СуммаБезНДСРеглОборот) КАК СуммаБезНДС,
	                      |	СУММА(Обороты.СуммаРеглОборот) КАК СуммаСНДС,
	                      |	МАКСИМУМ(Обороты.СтавкаНДС) КАК СтавкаНДС
	                      |ПОМЕСТИТЬ ВР_Итог
	                      |{ВЫБРАТЬ
	                      |	Сценарий.*,
	                      |	ЦФО.*,
	                      |	СтатьяОборотов.*,
	                      |	Аналитика_1.*,
	                      |	Аналитика_2.*,
	                      |	СуммаВРамкахБюджета,
	                      |	СуммаЗаРамкамиБюджета,
	                      |	СуммаОстаток,
	                      |	Период,
	                      |	СуммаСНДСОстаток,
	                      |	СуммаСНДСВРамкахБюджета,
	                      |	СуммаСНДСЗаРамкамиБюджета,
	                      |	СтавкаНДС.*,
	                      |	бит_БК_Организация.*,
	                      |	Проект.*,
	                      |	СуммаБезНДС,
	                      |	СуммаСНДС}
	                      |ИЗ
	                      |	Обороты КАК Обороты
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыФакт КАК ОборотыФакт
	                      |		ПО Обороты.ЦФО = ОборотыФакт.ЦФО
	                      |			И Обороты.СтатьяОборотов = ОборотыФакт.СтатьяОборотов
	                      |			И Обороты.Аналитика_1 = ОборотыФакт.Аналитика_1
	                      |			И Обороты.Аналитика_2 = ОборотыФакт.Аналитика_2
	                      |			И (ВЫБОР
	                      |				КОГДА Обороты.Сценарий = ЗНАЧЕНИЕ(Справочник.бит_СценарииБюджетирования.Заявка_У)
	                      |					ТОГДА ОборотыФакт.Сценарий = ЗНАЧЕНИЕ(Справочник.бит_СценарииБюджетирования.Факт_У)
	                      |				КОГДА Обороты.Сценарий = ЗНАЧЕНИЕ(Справочник.бит_СценарииБюджетирования.Заявка_Инвест)
	                      |					ТОГДА ОборотыФакт.Сценарий = ЗНАЧЕНИЕ(Справочник.бит_СценарииБюджетирования.Контракт_Инвест)
	                      |				КОГДА Обороты.Сценарий = ЗНАЧЕНИЕ(Справочник.бит_СценарииБюджетирования.Контракт_Инвест)
	                      |					ТОГДА ОборотыФакт.Сценарий = ЗНАЧЕНИЕ(Справочник.бит_СценарииБюджетирования.Факт_Инвест)
	                      |				ИНАЧЕ ЛОЖЬ
	                      |			КОНЕЦ)
	                      |			И (ВЫБОР
	                      |				КОГДА Обороты.Сценарий = ЗНАЧЕНИЕ(Справочник.бит_СценарииБюджетирования.Заявка_Инвест)
	                      |						ИЛИ Обороты.Сценарий = ЗНАЧЕНИЕ(Справочник.бит_СценарииБюджетирования.Контракт_Инвест)
	                      |					ТОГДА Обороты.Проект = ОборотыФакт.Проект
	                      |				ИНАЧЕ ИСТИНА
	                      |			КОНЕЦ)
	                      |			И (ВЫБОР
	                      |				КОГДА Обороты.Сценарий = ЗНАЧЕНИЕ(Справочник.бит_СценарииБюджетирования.Заявка_Инвест)
	                      |						ИЛИ Обороты.Сценарий = ЗНАЧЕНИЕ(Справочник.бит_СценарииБюджетирования.Контракт_Инвест)
	                      |					ТОГДА ИСТИНА
	                      |				ИНАЧЕ Обороты.Период = ОборотыФакт.Период
	                      |			КОНЕЦ)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстаток КАК ТаблицаОстаток
	                      |		ПО Обороты.ЦФО = ТаблицаОстаток.ЦФО
	                      |			И Обороты.СтатьяОборотов = ТаблицаОстаток.СтатьяОборотов
	                      |			И Обороты.Аналитика_2 = ТаблицаОстаток.Аналитика_2
	                      |			И Обороты.Аналитика_1 = ТаблицаОстаток.Аналитика_1
	                      |			И Обороты.ЦФО = ТаблицаОстаток.ЦФО
	                      |			И Обороты.Период = ТаблицаОстаток.Период
	                      |ГДЕ
	                      |	ТаблицаОстаток.Остаток > 0
	                      |{ГДЕ
	                      |	Обороты.Сценарий,
	                      |	Обороты.Период,
	                      |	Обороты.ЦФО.*,
	                      |	Обороты.СтатьяОборотов.*,
	                      |	Обороты.Аналитика_1.*,
	                      |	Обороты.Аналитика_2.*,
	                      |	Обороты.Проект.*}
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Обороты.Сценарий,
	                      |	Обороты.ЦФО,
	                      |	Обороты.Проект,
	                      |	Обороты.Аналитика_2,
	                      |	Обороты.Аналитика_1,
	                      |	Обороты.СтатьяОборотов,
	                      |	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВР_Итог.Сценарий КАК Сценарий,
	                      |	ВР_Итог.ЦФО КАК ЦФО,
	                      |	ВР_Итог.СтатьяОборотов КАК СтатьяОборотов,
	                      |	ВР_Итог.Аналитика_1 КАК Аналитика_1,
	                      |	ВР_Итог.Аналитика_2 КАК Аналитика_2,
	                      |	СУММА(ВР_Итог.СуммаОстаток) КАК СуммаОстаток,
	                      |	СУММА(ВР_Итог.СуммаВРамкахБюджета) КАК СуммаВРамкахБюджета,
	                      |	СУММА(ВР_Итог.СуммаЗаРамкамиБюджета) КАК СуммаЗаРамкамиБюджета,
	                      |	СУММА(ВР_Итог.СуммаСНДСОстаток) КАК СуммаСНДСОстаток,
	                      |	СУММА(ВР_Итог.СуммаСНДСВРамкахБюджета) КАК СуммаСНДСВРамкахБюджета,
	                      |	СУММА(ВР_Итог.СуммаСНДСЗаРамкамиБюджета) КАК СуммаСНДСЗаРамкамиБюджета,
	                      |	ВР_Итог.бит_БК_Организация КАК бит_БК_Организация,
	                      |	ВР_Итог.Проект КАК Проект,
	                      |	СУММА(ВР_Итог.СуммаБезНДС) КАК СуммаБезНДС,
	                      |	СУММА(ВР_Итог.СуммаСНДС) КАК СуммаСНДС,
	                      |	ВЫБОР
	                      |		КОГДА ВР_Итог.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	                      |		ИНАЧЕ ВР_Итог.СтавкаНДС
	                      |	КОНЕЦ КАК СтавкаНДС,
	                      |	ВР_Итог.Период КАК Период
	                      |{ВЫБРАТЬ
	                      |	Сценарий.*,
	                      |	ЦФО.*,
	                      |	СтатьяОборотов.*,
	                      |	Аналитика_1.*,
	                      |	Аналитика_2.*,
	                      |	СуммаОстаток,
	                      |	СуммаВРамкахБюджета,
	                      |	СуммаЗаРамкамиБюджета,
	                      |	СуммаСНДСОстаток,
	                      |	СуммаСНДСВРамкахБюджета,
	                      |	СуммаСНДСЗаРамкамиБюджета,
	                      |	бит_БК_Организация.*,
	                      |	Проект.*,
	                      |	СуммаБезНДС,
	                      |	СуммаСНДС,
	                      |	СтавкаНДС.*,
	                      |	Период}
	                      |ИЗ
	                      |	ВР_Итог КАК ВР_Итог
	                      |ГДЕ
	                      |	ВР_Итог.Аналитика_1 = &Аналитика_1
	                      |{ГДЕ
	                      |	ВР_Итог.Период,
	                      |	ВР_Итог.Сценарий,
	                      |	ВР_Итог.ЦФО.*,
	                      |	ВР_Итог.СтатьяОборотов.*,
	                      |	ВР_Итог.Аналитика_1.*,
	                      |	ВР_Итог.Аналитика_2.*,
	                      |	ВР_Итог.СуммаОстаток,
	                      |	ВР_Итог.Проект.*}
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВР_Итог.Сценарий,
	                      |	ВР_Итог.Аналитика_1,
	                      |	ВР_Итог.Аналитика_2,
	                      |	ВР_Итог.ЦФО,
	                      |	ВР_Итог.СтатьяОборотов,
	                      |	ВР_Итог.бит_БК_Организация,
	                      |	ВР_Итог.Проект,
	                      |	ВР_Итог.Период,
	                      |	ВЫБОР
	                      |		КОГДА ВР_Итог.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	                      |		ИНАЧЕ ВР_Итог.СтавкаНДС
	                      |	КОНЕЦ");	
						  
						  
	СписокОбороты 	= Новый СписокЗначений;
	СписокОбороты.Добавить(Справочники.бит_СценарииБюджетирования.Заявка_Инвест);
	СписокОбороты.Добавить(Справочники.бит_СценарииБюджетирования.Заявка_У);
	СписокОбороты.Добавить(Справочники.бит_СценарииБюджетирования.Контракт_Инвест);
	
	СписокФакт		= Новый СписокЗначений;
	СписокФакт.Добавить(Справочники.бит_СценарииБюджетирования.Факт_Инвест);
	СписокФакт.Добавить(Справочники.бит_СценарииБюджетирования.Факт_У);
	СписокФакт.Добавить(Справочники.бит_СценарииБюджетирования.Контракт_Инвест);
						  
	Запрос.УстановитьПараметр("Аналитика_1",ДокументОснование);
	Запрос.УстановитьПараметр("СценарииОбороты",	СписокОбороты);
	Запрос.УстановитьПараметр("СценарииФакт",		СписокФакт);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
