////////////////////////////////////////////////////////////////////////////////
// ЗАПОЛНЕНИЕ БУХГАЛТЕРСКОЙ ОТЧЕТНОСТИ.
// Модуль содержит переопределяемые процедуры и функции.
// Предназначен для заполнения регламентированного отчета
// "Бухгалтерская отчетность организаций" и финансовой отчетности в банки.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗаполнениеБухгалтерскойОтчетностиПоказатели

// Возвращает признак учета расходов по элементам затрат организацией в течении указанного периода.
//
// Параметры:
//   НачалоПериодаОтчета - Дата - дата начала периода, за который проводится проверка вида учета расходов;
//   КонецПериодаОтчета - Дата - дата конца периода, за который проводится проверка вида учета расходов;
//   Организация - СправочникСсылка.Организация - организация, для которой нужно получить признак.
//
// Возвращаемое значение:
//   Булево - Истина, если в течении проверяемого периода организация вела учет расходов
//     по элементам затрат.
//
// Пример реализации:
//   Возврат ЭлементыЗатратНастройкаПараметровУчета.РасходыУчитываютсяПоЭлементамЗатрат(
//     НачалоПериодаОтчета, КонецПериодаОтчета, Организация);
//
Функция РасходыУчитываютсяПоЭлементамЗатрат(НачалоПериодаОтчета, КонецПериодаОтчета, Организация) Экспорт
	
	Возврат ЭлементыЗатратНастройкаПараметровУчета.РасходыУчитываютсяПоЭлементамЗатрат(
		НачалоПериодаОтчета, КонецПериодаОтчета, Организация);
	
КонецФункции

// Заполняет описание структуры отчета о целевом использовании полученных средств - состав ее граф и строк
//
// Параметры:
//  Строки		 - Строка - возвращаемый параметр - перечень четырехзначных номеров строк отчета, разделенных запятыми
//  Упрощенная	 - Булево - Истина для упрощенной отчетности (содержащей сокращенный перечень строк)
//
Процедура ЗаполнитьОписаниеСтрокОЦИС(Строки, Упрощенная) Экспорт
	
	
КонецПроцедуры

// Предоставляет данные для заполнения отчета об использовании целевых поступивших средств.
// Данные собираются по одной организации, без учета входящих в нее филиалов.
//
// Параметры:
//  ПоказателиОтчета  - Соответствие - возвращаемый параметр, значения для заполнения строк отчета
//                      * Ключ - Строка - четырехсимвольный код строки
//                      * Значение - Число - значение показателя
//  РасшифровкаОтчета - ТаблицаЗначений - см. ЗаполнениеРасшифровкаРегламентированнойОтчетности.НовыйРасшифровка
//                      В таблице
//                       - в поле ИмяПоказателя указывается четырехсимвольный код строки
//                       - не заполняется поле ИмяРаздела, определяемое кодом строки отчета
//  НачалоПериода - Дата (без времени) - начало периода отчета
//  КонецПериода  - Дата (без времени) - конец периода отчета
//  Организация   - СправочникСсылка.Организации - организация, по которой собираются данные
//  Упрощенная    - Булево - Истина для упрощенной отчетности (с меньшей детализацией)
//
Процедура ПолучитьДанныеЗаполненияОЦИС(ПоказателиОтчета, РасшифровкаОтчета, НачалоПериода, КонецПериода, Организация, Упрощенная) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
