////////////////////////////////////////////////////////////////////////////////
// Клиент-серверные процедуры и функции событий форм ИСМП
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура, вызываемая при чтении/создании/записи формы, а так же при изменении
// ключевых реквизитов документа  ИСМП.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//
Процедура УправлениеДоступностьюЭлементовФормы(Форма) Экспорт
	
	МассивИмен = СтрРазделить(Форма.ИмяФормы, ".");
	
	Пока МассивИмен.Количество() > 2 Цикл
		МассивИмен.Удалить(МассивИмен.ВГраница());
	КонецЦикла;
	
	ПолноеИмяМетаданных = СтрСоединить(МассивИмен, ".");
	
	Если Не ИнтеграцияИСМПКлиентСерверПовтИсп.ДокументМожетИметьДокументОснование(ПолноеИмяМетаданных) Тогда
		Форма.Элементы.ДокументОснование.Видимость = Ложь;
		Форма.Элементы.ТоварыПерезаполнитьПоОснованию.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти