
#Область ПрограммныйИнтерфейс

// Возвращает признак необходимости показа предупреждения о заполнении реквизитов патента.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация, которой принадлежит патент.
//  Патент - СправочникСсылка.Патенты - Патент.
//  ТолькоУСНПатент - Булево - Признак применения организацией УСН на основе патента без совмещения с другими режимами налогообложения.
//  НесколькоПатентов - Булево - Признак наличия нескольких действующих патентов для указанной организации.
//
// Возвращаемое значение:
//  Булево - Признак необходимости показа предупреждения.
//
Функция ПоказатьПредупреждениеНеобходимоЗаполнитьПатент(Организация, Патент, ТолькоУСНПатент, НесколькоПатентов) Экспорт
	
	Если ЗначениеЗаполнено(Организация)
		И ТолькоУСНПатент
		И НЕ ЗначениеЗаполнено(Патент)
		И НЕ НесколькоПатентов Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Рассчитывает потенциально возможный доход по патенту
//
// Параметры:
//  ПотенциальноВозможныйГодовойДоход - Число - потенциально возможный к получению годовой доход
//  ДатаНачала - Дата - дата начала действия патента
//  ДатаОкончания - Дата - дата окончания действия патента
//
Функция РассчитатьПотенциальноВозможныйДоход(ПотенциальноВозможныйГодовойДоход, ДатаНачала, ДатаОкончания) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания)
		Или Год(ДатаНачала) <> Год(ДатаОкончания) Тогда
		Возврат ПотенциальноВозможныйГодовойДоход;
	КонецЕсли;
	
	Если РассчитыватьСтоимостьПатентаПоКалендарнымДням(ДатаНачала, ДатаОкончания) Тогда
		
		ОдинДень = 86400; // Секунд в сутках (24*60*60)
		
		КоличествоДнейСрока = (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / ОдинДень + 1;
		КоличествоДнейВГоду = (КонецГода(ДатаОкончания) + 1 - НачалоГода(ДатаОкончания)) / ОдинДень;
		
		ПотенциальноВозможныйДоход = ПотенциальноВозможныйГодовойДоход * КоличествоДнейСрока / КоличествоДнейВГоду;
		
	Иначе
		
		ДействуетСНачалаМесяца = НачалоДня(ДатаНачала) = НачалоМесяца(ДатаНачала);
		КоличествоМесяцевСрока = Месяц(ДатаОкончания) - Месяц(ДатаНачала) + ?(ДействуетСНачалаМесяца, 1, 0);
		
		ПотенциальноВозможныйДоход = ПотенциальноВозможныйГодовойДоход * КоличествоМесяцевСрока / 12;
		
	КонецЕсли;
	
	Возврат Окр(ПотенциальноВозможныйДоход, 2, РежимОкругления.Окр15как20);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает ставку налога по патентной системе налогообложения
//
// Возвращаемое значение:
//  Число
//
Функция НалоговаяСтавкаПоУмолчанию() Экспорт
	
	Возврат 6;
	
КонецФункции

Функция ОтражениеДоходовСоздатьПатентЗначение() Экспорт
	
	Возврат "НовыйПатент";
	
КонецФункции

Функция ОтражениеДоходовСоздатьПатентПредставление() Экспорт
	
	Возврат НСтр("ru = 'Создать патент ...'");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасчетСтоимостиПатента

Функция РассчитыватьСтоимостьПатентаПоКалендарнымДням(ДатаНачала, ДатаОкончания)
	
	// П. 62 ст. 2 Федерального закона от 29.09.2019 N 325-ФЗ изменил расчет налога по патенту (п. 1 ст. 346.51 НК РФ).
	// Ранее налог рассчитывался пропорционально количеству месяцев срока действия,
	// после вступления в силу новой редакции НК налог рассчитывается по календарным дням срока действия патента.
	// Изменения вступили в силу с 29 октября 2019 года.
	ДатаНачалаРасчетаПоКалендарнымДням = '20191029';
	
	Если ДатаНачала >= ДатаНачалаРасчетаПоКалендарнымДням Тогда
		
		Возврат Истина;
		
	ИначеЕсли ПатентПрекращенДосрочно(ДатаНачала, ДатаОкончания) Тогда
		
		// В случае прекращения предпринимательской деятельности до истечения срока патента налог пересчитывается
		// исходя из фактического периода времени осуществления предпринимательской деятельности в календарных днях.
		Возврат Истина;
		
	Иначе
		
		// Патент выдан на срок, кратный месяцу, и рассчитывается по количеству месяцев срока.
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Функция ПатентПрекращенДосрочно(ДатаНачала, ДатаОкончания)
	
	ОдинДень = 86400; // Секунд в сутках (24*60*60)
	
	ДействуетСНачалаМесяца = НачалоДня(ДатаНачала) = НачалоМесяца(ДатаНачала);
	КоличествоМесяцевСрока = Месяц(ДатаОкончания) - Месяц(ДатаНачала) + ?(ДействуетСНачалаМесяца, 1, 0);
	
	РасчетнаяДатаОкончания = ДобавитьМесяц(ДатаНачала, КоличествоМесяцевСрока) - ОдинДень;
	
	Возврат НачалоДня(ДатаОкончания) <> НачалоДня(РасчетнаяДатаОкончания);
	
КонецФункции

#КонецОбласти

Функция НавигационнаяСсылкаНеобходимоЗаполнитьПатент() Экспорт
	
	Возврат "НеобходимоЗаполнитьПатент";
	
КонецФункции

Функция СсылкаНаСтатьюУменьшениеНалога() Экспорт
	
	Возврат "http://buh.ru/articles/documents/63785/";
	
КонецФункции

// Возвращает шаблон строки ссылки на закон субъекта РФ,
// раздел "Особенности регионального законодательства"
//
// Возвращаемое значение:
//  Строка
//
Функция ШаблонСсылкиНаЗаконРегиона() Экспорт
	
	Возврат "https://www.nalog.ru/rn%1/taxation/taxes/patent/#title22";
	
КонецФункции

// Возвращает шаблон строки ссылки на Классификатор видов предпринимательской деятельности
//
// Возвращаемое значение:
//  Строка
//
Функция ШаблонСсылкиНаКлассификаторВидовДеятельности() Экспорт
	
	Возврат "https://www.nalog.ru/rn%1/taxation/taxes/patent/#title23";
	
КонецФункции

#КонецОбласти
