////////////////////////////////////////////////////////////////////////////////
//
// Учитывает особенности реализации в конфигурации-носителе.
// При обновлении библиотеки переносить только состав процедур и функций без содержимого.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет объекты конфигурации, в модулях менеджеров которых размещена процедура ДобавитьКомандыПечати,
// формирующая список команд печати, предоставляемых этим объектом.
// Синтаксис процедуры ДобавитьКомандыПечати см. в документации к подсистеме.
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов с процедурой ДобавитьКомандыПечати.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.бит_АктуализацияБюджета);
	СписокОбъектов.Добавить(Документы.бит_БюджетнаяОперация);
	СписокОбъектов.Добавить(Документы.бит_вго_АктСверкиВГО);
	СписокОбъектов.Добавить(Документы.бит_вго_ПодтверждениеСверкиВГО);
	СписокОбъектов.Добавить(Документы.бит_вго_ПротоколРасхождений);
	СписокОбъектов.Добавить(Документы.бит_ВерсияОтчета);
	СписокОбъектов.Добавить(Документы.бит_ДополнительныеУсловияПоДоговору);
	СписокОбъектов.Добавить(Документы.бит_ЗакрытиеЗаявок);
	СписокОбъектов.Добавить(Документы.бит_ЗакрытиеСчетов);
	СписокОбъектов.Добавить(Документы.бит_ЗаявкаНаЗатраты);
	СписокОбъектов.Добавить(Документы.бит_ЗаявкаНаРасходованиеСредств);
	СписокОбъектов.Добавить(Документы.бит_ЗаявкаНаРасходованиеСредствОбщая);
	СписокОбъектов.Добавить(Документы.бит_ИсковоеТребование);
	СписокОбъектов.Добавить(Документы.бит_КорректировкаБюджета);
	СписокОбъектов.Добавить(Документы.бит_КорректировкаКонтрольныхЗначений);
	СписокОбъектов.Добавить(Документы.бит_мдм_ЗаявкаНаИзменение);
	СписокОбъектов.Добавить(Документы.бит_мдм_ЗаявкаНаУдаление);
	СписокОбъектов.Добавить(Документы.бит_мто_ВыдачаТМЦПоЗаявкамНаПотребность);
	СписокОбъектов.Добавить(Документы.бит_мто_ЗаявкаНаЗакупку);
	СписокОбъектов.Добавить(Документы.бит_мто_ЗаявкаНаПотребность);
	СписокОбъектов.Добавить(Документы.бит_мто_ОтражениеФактаЗакупки);
	СписокОбъектов.Добавить(Документы.бит_мто_ПередачаВОбеспечениеСоСклада);
	СписокОбъектов.Добавить(Документы.бит_му_ВыбытиеНМА);
	СписокОбъектов.Добавить(Документы.бит_му_ВыбытиеОС);
	СписокОбъектов.Добавить(Документы.бит_му_ВыработкаВНА);
	СписокОбъектов.Добавить(Документы.бит_му_ЗачетАвансовПоЛизингу);
	СписокОбъектов.Добавить(Документы.бит_му_ИзменениеПараметровУчетаНМА);
	СписокОбъектов.Добавить(Документы.бит_му_ИзменениеПараметровУчетаОС);
	СписокОбъектов.Добавить(Документы.бит_му_КонсолидационныеКорректировки);
	СписокОбъектов.Добавить(Документы.бит_му_КонсолидационныеКорректировкиНовый);
	СписокОбъектов.Добавить(Документы.бит_му_КорректировкаГрафиковФинансовыхНачислений);
	СписокОбъектов.Добавить(Документы.бит_му_КорректировкаСтоимостиМПЗ);
	СписокОбъектов.Добавить(Документы.бит_му_МодернизацияОС);
	СписокОбъектов.Добавить(Документы.бит_му_НачислениеАмортизацииНМА);
	СписокОбъектов.Добавить(Документы.бит_му_НачислениеАмортизацииОС);
	СписокОбъектов.Добавить(Документы.бит_му_НачислениеПроцентовПоФинИнструментам);
	СписокОбъектов.Добавить(Документы.бит_му_НачислениеРезерваПоМПЗ);
	СписокОбъектов.Добавить(Документы.бит_му_НачислениеФинансовыхПроцентовПоАрендеОС);
	СписокОбъектов.Добавить(Документы.бит_му_ОбесценениеДебиторскойЗадолженности);
	СписокОбъектов.Добавить(Документы.бит_му_ОбесценениеНМА);
	СписокОбъектов.Добавить(Документы.бит_му_ОбесценениеОС);
	СписокОбъектов.Добавить(Документы.бит_му_ПереводОСВСоставИнвестиционнойСобственности);
	СписокОбъектов.Добавить(Документы.бит_му_ПеремещениеОС);
	СписокОбъектов.Добавить(Документы.бит_му_ПереоценкаНМА);
	СписокОбъектов.Добавить(Документы.бит_му_ПереоценкаОС);
	СписокОбъектов.Добавить(Документы.бит_му_ПересчетВВалютуПредставления);
	СписокОбъектов.Добавить(Документы.бит_му_ПоступлениеМПЗ);
	СписокОбъектов.Добавить(Документы.бит_му_ПризнаниеФинИнструментов);
	СписокОбъектов.Добавить(Документы.бит_му_ПринятиеКУчетуНМА);
	СписокОбъектов.Добавить(Документы.бит_му_ПринятиеКУчетуОС);
	СписокОбъектов.Добавить(Документы.бит_му_ПрекращениеАрендыОС);
	СписокОбъектов.Добавить(Документы.бит_му_РазнесениеСальдоНаОтчетнуюДату);
	СписокОбъектов.Добавить(Документы.бит_му_РаспределениеПлатежейПоКредитамЗаймам);
	СписокОбъектов.Добавить(Документы.бит_му_РасчетОтложенныхНалогов);
	СписокОбъектов.Добавить(Документы.бит_му_РеализацияМПЗ);
	СписокОбъектов.Добавить(Документы.бит_му_РеклассификацияЗадолженности);
	СписокОбъектов.Добавить(Документы.бит_му_РеклассификацияЗадолженностиПоФинансовойАрендеОС);
	СписокОбъектов.Добавить(Документы.бит_му_СторноЭлиминационныхНачислений);
	СписокОбъектов.Добавить(Документы.бит_му_Элиминация);
	СписокОбъектов.Добавить(Документы.бит_НазначениеПравилТрансляции);
	СписокОбъектов.Добавить(Документы.бит_ОперацияБюджетирование);
	СписокОбъектов.Добавить(Документы.бит_ОперацияУправленческий);
	СписокОбъектов.Добавить(Документы.бит_ПереоценкаВалютныхДенежныхСтатей);
	СписокОбъектов.Добавить(Документы.бит_ПланируемоеПоступлениеДенежныхСредств);
	СписокОбъектов.Добавить(Документы.бит_ПлатежнаяПозиция);
	СписокОбъектов.Добавить(Документы.бит_Претензия);
	СписокОбъектов.Добавить(Документы.бит_ПроектДоговора);
	СписокОбъектов.Добавить(Документы.бит_ПротоколРасхожденийБюджета);
	СписокОбъектов.Добавить(Документы.бит_Проформы);
	СписокОбъектов.Добавить(Документы.бит_РаспределениеБюджета);
	СписокОбъектов.Добавить(Документы.бит_РасходнаяПозиция);
	СписокОбъектов.Добавить(Документы.бит_РеестрПлатежей);
	СписокОбъектов.Добавить(Документы.бит_СведенияОбОстаткахДенежныхСредств);
	СписокОбъектов.Добавить(Документы.бит_СобытиеДоговора);
	СписокОбъектов.Добавить(Документы.бит_СправкаОВалютныхОперациях);
	СписокОбъектов.Добавить(Документы.бит_СправкаОПодтверждающихДокументах);
	СписокОбъектов.Добавить(Документы.бит_удалить_КорректировкаЗаписейРегистров);
	СписокОбъектов.Добавить(Документы.бит_УстановкаАктивныхКомплектовДвижений);
	СписокОбъектов.Добавить(Документы.бит_УстановкаЗависимыхОборотов);
	СписокОбъектов.Добавить(Документы.бит_УстановкаЗначенийПроизвольныхПараметров);
	СписокОбъектов.Добавить(Документы.бит_УстановкаКонтрольныхЗначений);
	СписокОбъектов.Добавить(Документы.бит_УстановкаНеснижаемыхОстатков);
	СписокОбъектов.Добавить(Документы.бит_ФормаВводаБюджета);
	СписокОбъектов.Добавить(ЖурналыДокументов.бит_вго_ДокументыПорталаСверкиВГО);
	СписокОбъектов.Добавить(ЖурналыДокументов.бит_мто_ОтраженияФактаЗакупки);
	СписокОбъектов.Добавить(Обработки.бит_РабочееМестоКазначея);
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-10-23 (#3393)
	СписокОбъектов.Добавить(Документы.бит_БК_КорректировкаКонтрольныхЗначенийИБюджета);
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-10-23 (#3393)
	
	//1С-ИжТиСи, Кондратьев, 03.2020, обновление (    
	СписокОбъектов.Добавить(Документы.рс_РаспределениеРасходовОфисов);
	СписокОбъектов.Добавить(Документы.рс_РаспределениеДоходовИРасходовЛогистики);
	//1С-ИжТиСи, Кондратьев, 03.2020, обновление )
	
КонецПроцедуры

#КонецОбласти
