/////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Общий модуль выполняет обработку события "ПриЗаписи" 
// Для объектов включенных в подписку "ок_ПриЗаписиДокументов"
//
// Для расширения функциональности, необходимо:
// 1. Включить "ДокументОбъект" в подписку "ок_ПриЗаписиДокументов"
// 2. В процедуре "ок_ПриЗаписиДокументовПриЗаписи" добавить ветку условия с проверкой на тип источника
// 3. Создать область по шаблону "Документ_ИмяДокумента"
// 4. Создать процедуру внутри области по шаблону "ПриЗаписиДокумента_ИмяДокумента"
// 5. Вызвать созданную процедуру из ветки условия в процедуре "ок_ПриЗаписиДокументовПриЗаписи"
// 6. Необходимые служебные процедуры и функции размещать в области модуля "СлужебныеПроцедурыИФункции"
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

//Процедура вызываемая подпиской на событие "ок_ПриЗаписиДокументов"
// Параметры:
// Источник - Документ, Тип - ДокументОбъект
// Отказ - Флаг отказа, Тип - Булево
Процедура ок_ПриЗаписиДокументовПриЗаписи(Источник, Отказ) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти