////////////////////////////////////////////////////////////////////////////////
// В этом модуле содержится дополнения БИТ к коду обработчиков модуля приложения. 
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура выполняется перед интерактивном началом работы пользователя с областью данных.
// Соответствует обработчику ПередНачаломРаботыСистемы.
// 
// Параметры:
//  Отказ - Булево - отказ в от начала работы. Если параметр установить в Истина,
// 					начало работы с областью осуществлено не будет.
// 
Процедура ПередНачаломРаботыСистемы(Отказ) Экспорт
	
	РезСтр = бит_ПолныеПрава.ДействияПередСтартомСистемы();
	Отказ = РезСтр.Отказ;
	Если РезСтр.Отказ Тогда
		
		ВызватьИсключение РезСтр.ТекстСообщения;
		
	Иначе
		бит_РаботаСДиалогамиКлиент.УстановитьПараметрыОпций(РезСтр.ЭтоИнтПоставка);
	КонецЕсли; 
		
КонецПроцедуры // ПередНачаломРаботыСистемы()

// Процедура выполняется при интерактивном начале работы пользователя с областью данных.
// Соответствует обработчику ПриНачалеРаботыСистемы.
// 
// Параметры:
//  Параметры - Структура - структура параметров.
// 
Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
	
	бит_ОбщегоНазначенияКлиент.ДействияПриНачалеРаботыСистемы();
		
КонецПроцедуры // ПриНачалеРаботыСистемы()

// См. ОбновлениеИнформационнойБазыКлиентПереопределяемый.ПриОпределенииВозможностиОбновления().
//
Процедура ПриОпределенииВозможностиОбновления() Экспорт
	
	// ЗДЕСЬ МОЖНО ОГРАНИЧИТЬ МИНИМАЛЬНУЮ ВЕРСИЮ ПРИ ОБНОВЛЕНИИ КОНФИГУРАЦИИ.
	// NB: ПРИМЕР ИЗ УТ.
	
	//МинимальноДопустимаяВерсия = "11.4.7"; // для УТ11
	//
	//ПараметрыКлиента = Новый Структура;
	//ОбщегоНазначенияУТВызовСервера.ПараметрыРаботыКлиентаПриЗапуске(ПараметрыКлиента);
	//
	//Если ПараметрыКлиента.ВерсияДанных = "0.0.0.0" Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//// Проверим допустимость обновления
	//ТекущаяВерсияКонфигурации  = ОбщегоНазначенияКлиентСервер.ВерсияКонфигурацииБезНомераСборки(ПараметрыКлиента.ВерсияДанных);
	//
	//Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ТекущаяВерсияКонфигурации, МинимальноДопустимаяВерсия) < 0 Тогда
	//	Сообщение =
	//		НСтр("ru = 'Обновление на текущую версию допустимо только с версии %1 и выше.
	//		|(Недопустимая попытка обновления с версии %2)
	//		|Необходимо восстановить информационную базу из резервной копии
	//		|и повторить обновление согласно файлу 1cv8upd.htm'");
	//	Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение,
	//		МинимальноДопустимаяВерсия,
	//		ПараметрыКлиента.ВерсияДанных);
	//	ВызватьИсключение Сообщение;
	//КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти

