
Функция ПолучитьСписокДоменовСБИС() Экспорт
	
	ДоменыСБИС = ок_ОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("ЭДО", "Домены СБИС", "");
	
	Если ДоменыСБИС = "" Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДоменыСБИС, ";", Истина);
	
КонецФункции

//ОКЕЙ Назаренко Д.В. (СофтЛаб) Начало 2021-04-07 (#4070)
Функция ПолучитьСписокСкрываемыхРасширенийСБИС() Экспорт
	
	СкрываемыеРасширенияСБИС = ок_ОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("ЭДО", "Скрываемые расширения СБИС", "");
	
	Если СкрываемыеРасширенияСБИС = "" Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СкрываемыеРасширенияСБИС, ";", Истина);
	
КонецФункции
//ОКЕЙ Назаренко Д.В. (СофтЛаб) Конец 2021-04-07 (#4070) 

//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-05-19 (#МДМ)
// Функция получает массив ролей, которые предоставляют переданное право доступа
//
// Параметры:
//  <ПравоДоступа>  		- <Строка> - название права доступа к объекту метаданных
//  <ОбъектМетаданных>  	- <ОбъектМетаданных>, <Строка> - Если передана строка, то формат следующий "Справочники.Контрагенты"
//  <Пользователь>  		- <Справочник.Пользователи> - Необязательный параметр, если заполнен, то выполняется проверка на наличие у пользователя роли.
//  <МассивРолейИсключение> - <Массив>, <Строка> - Если передана строка, то формат следующий "Роль1;Роль2;Роль3"
//
// Возвращаемое значение:
//   <Массив>   - Массив ролей с указанным правом доступа на объект метаданных с возможным отбором по пользователю и исключающим ролям.
//
Функция ПолучитьМассивРолейПоПравуДляОбъекта(ПравоДоступа, Знач ОбъектМетаданных, Пользователь = Неопределено, Знач МассивРолейИсключение = Неопределено) Экспорт

	МассивРолей = Новый Массив;
	
	Если ТипЗнч(ОбъектМетаданных) = Тип("Строка") Тогда
		
		МассивПутиКОбъектуМетаданных = СтрРазделить(ОбъектМетаданных, ".", Ложь);
		Если МассивПутиКОбъектуМетаданных.Количество() <> 2 Тогда
			Возврат МассивРолей;
		КонецЕсли;
		
		ОбъектМетаданных = Метаданные[МассивПутиКОбъектуМетаданных[0]][МассивПутиКОбъектуМетаданных[1]];
		
	КонецЕсли;
	
	Если ТипЗнч(МассивРолейИсключение) = Тип("Строка")Тогда
	
		МассивРолейИсключение = СтрРазделить(МассивРолейИсключение, ";", Ложь);
		Счетчик = 0;
		Пока Счетчик <> МассивРолейИсключение.Количество() Цикл
			МассивРолейИсключение[Счетчик] = СокрЛП(МассивРолейИсключение[Счетчик]);
			Счетчик = Счетчик + 1;
		КонецЦикла; 
		
	ИначеЕсли ТипЗнч(МассивРолейИсключение) = Тип("Массив")Тогда
	
		Счетчик = 0;
		Пока Счетчик <> МассивРолейИсключение.Количество() Цикл
			Если ТипЗнч(МассивРолейИсключение[Счетчик]) = Тип("Строка") Тогда
				МассивРолейИсключение[Счетчик] = СокрЛП(МассивРолейИсключение[Счетчик]);
			Иначе
				МассивРолейИсключение[Счетчик] = СокрЛП(МассивРолейИсключение[Счетчик].Имя);
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
	КонецЕсли; 
	
	Для каждого ТекущаяРоль Из Метаданные.Роли Цикл
		
		Если МассивРолейИсключение = Неопределено
			ИЛИ ТипЗнч(МассивРолейИсключение) = Тип("Массив")
				И МассивРолейИсключение.Найти(ТекущаяРоль.Имя) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		Если ПравоДоступа(ПравоДоступа, ОбъектМетаданных, ТекущаяРоль)
			И (Пользователь = Неопределено
				ИЛИ УправлениеДоступомСлужебныйПовтИсп.ЕстьРоль(ТекущаяРоль.Имя,, Пользователь, Ложь)) Тогда
		
			МассивРолей.Добавить(ТекущаяРоль);
		
		КонецЕсли; 
	
	КонецЦикла;
	
	Возврат МассивРолей;
	
КонецФункции 
//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-05-19 (#МДМ)

//ОКЕЙ Назаренко Д.В. (СофтЛаб) Начало 2021-06-28 (#4244)
Функция ПолучитьМассивЗначимыхКодовТранзакции() Экспорт
	
	// ОКЕЙ Смирнов М.В. (СофтЛаб) Начало 2021-08-31 (#4181)
	//ПользовательскаяФункция = ок_ОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("ЭДО", "Значимые коды транзакции", "");
	//Если ЗначениеЗаполнено(ПользовательскаяФункция) Тогда
	//	
	//	ЗначимыеКодыТранзакции = бит_ОбщегоНазначения.ВыполнитьПользовательскуюФункцию(ПользовательскаяФункция);
	//	Если ТипЗнч(ЗначимыеКодыТранзакции) = Тип("Массив") Тогда
	//		Возврат ЗначимыеКодыТранзакции;
	//	Иначе
	//		ТекстЖР = "Проверьте корректность выполнения пользовательской функции";
	//		ЗаписьЖурналаРегистрации("ЭДО.Получение паков ЭД",УровеньЖурналаРегистрации.Ошибка,,ПользовательскаяФункция,ТекстЖР);
	//	КонецЕсли;
	//	
	//КонецЕсли;
	Результат = ок_ОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("ЭДО", "Значимые коды транзакции", "");
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;
	// ОКЕЙ Смирнов М.В. (СофтЛаб) Конец 2021-08-31 (#4181)
	
	Возврат Новый Массив;
		
КонецФункции

Функция ПолучитьМассивЗавершающихКодовТранзакции() Экспорт
	
	// ОКЕЙ Смирнов М.В. (СофтЛаб) Начало 2021-08-31 (#4181)
	//ПользовательскаяФункция = ок_ОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("ЭДО", "Завершающие коды транзакции", "");
	//Если ЗначениеЗаполнено(ПользовательскаяФункция) Тогда
	//	
	//	ЗавершающиеКодыТранзакции = бит_ОбщегоНазначения.ВыполнитьПользовательскуюФункцию(ПользовательскаяФункция);
	//	Если ТипЗнч(ЗавершающиеКодыТранзакции) = Тип("Массив") Тогда
	//		Возврат ЗавершающиеКодыТранзакции;
	//	Иначе
	//		ТекстЖР = "Проверьте корректность выполнения пользовательской функции";
	//		ЗаписьЖурналаРегистрации("ЭДО.Получение паков ЭД",УровеньЖурналаРегистрации.Ошибка,,ПользовательскаяФункция,ТекстЖР);	
	//	КонецЕсли;
	//	
	//КонецЕсли;
	Результат = ок_ОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("ЭДО", "Завершающие коды транзакции", "");
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;
	// ОКЕЙ Смирнов М.В. (СофтЛаб) Конец 2021-08-31 (#4181)
	
	Результат = Новый Массив;
	Результат.Добавить("Извещение о получении Уведомления о приеме");
	Результат.Добавить("Извещение о получении Уведомления об уточнении");
	
	Возврат Результат;		
		
КонецФункции
//ОКЕЙ Назаренко Д.В. (СофтЛаб) Конец 2021-06-28 (#4244) 

// ОКЕЙ Смирнов М.В. (СофтЛаб) Начало 2021-08-31 (#4181)
Функция ПолучитьМассивОтменяющихКодовТранзакции() Экспорт
	
	Результат = ок_ОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("ЭДО", "Отменяющие коды транзакции", "");
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;

	Возврат Новый Массив;		
	
КонецФункции
// ОКЕЙ Смирнов М.В. (СофтЛаб) Конец 2021-08-31 (#4181)

// ОКЕЙ Смирнов М.В. (СофтЛаб) Начало 2021-11-06 (#4407)
Функция ПолучитьЗначениеКонстантыВПривилегированномРежиме(ИмяКонстанты) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗначениеКонстанты = Неопределено;
	
	Попытка
		ЗначениеКонстанты = Константы[ИмяКонстанты].Получить();
	Исключение
		КонтекстСобытия = "ПолучитьЗначениеКонстантыВПривилегированномРежиме";
		ЗаписьЖурналаРегистрации(КонтекстСобытия, УровеньЖурналаРегистрации.Ошибка, ,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЗначениеКонстанты;
	
КонецФункции
// ОКЕЙ Смирнов М.В. (СофтЛаб) Конец 2021-11-06 (#4407)