// Возвращает структуру, содержащую различные персональные настройки
// по работе с файлами
Функция ПолучитьПерсональныеНастройкиРаботыСФайлами() Экспорт
	
	Настройки = Новый Структура;
	
	//izhtc-Kir 31.08.2015 (
	Сообщить("Персональные настройки работы с файлами не получены!", СтатусСообщения.ОченьВажное);
	//ФайловыеФункции.УстановитьПерсональныеНастройкиФайловыхФункций(Настройки);
	//izhtc-Kir 31.08.2015 )
	
	Возврат Настройки;
	
КонецФункции

// Возвращает структуру с двоичными данными файла и подписи
Функция ПолучитьДвоичныеДанныеФайлаИПодписи(ДанныеСтроки) Экспорт
	

	// ПрисоединенныеФайлы
	// В рабочей нет такой функции 		ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайлаИПодписи(ДанныеСтроки.Объект, ДанныеСтроки.АдресПодписи);
	//Если ПрисоединенныеФайлыСобытия.ЭтоЭлементПрисоединенныеФайлы(ДанныеСтроки.Объект) Тогда
	//	Возврат ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайлаИПодписи(ДанныеСтроки.Объект, ДанныеСтроки.АдресПодписи);
	//КонецЕсли;
	// Конец ПрисоединенныеФайлы
	
	Возврат Неопределено;
	
КонецФункции
