
#Область ПрограммныйИнтерфейс

// Обработчик события вызывается при получении имени кассира.
//
// Параметры:
//  ИмяКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИмяКассира(ИмяКассира, СтандартнаяОбработка) Экспорт
	ИмяКассира = КассовыеСменыВызовСервераБП.ПредставлениеКассираДляОрганизацииПоУмолчанию();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

// Обработчик события вызывается при получении ИНН кассира.
//
// Параметры:
//  ИННКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИННКассира(ИННКассира, СтандартнаяОбработка) Экспорт
	ИННКассира = КассовыеСменыВызовСервераБП.ИННКассираДляОрганизацииПоУмолчанию();
	СтандартнаяОбработка = НЕ ЗначениеЗаполнено(ИННКассира);
КонецПроцедуры

// Функция возвращает поддерживаемые форматы ФФД в прикладном решении.
//
Функция ПолучитьПоддерживаемыйФорматыФФД() Экспорт
	
	ФорматыФФД = Новый СписокЗначений();
	ФорматыФФД.Добавить("1.0");
	ФорматыФФД.Добавить("1.0.5");
	ФорматыФФД.Добавить("1.1");
	Возврат ФорматыФФД;
	
КонецФункции

#КонецОбласти