
#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет способ транспорта в зависимости от типа точки доставки.
//
// Параметры:
//   ТочкаДоставки - Строка, СправочникСсылка.бит_МобильныеУстройства.
//
// Возвращаемое значение:
//  СпособТранспорта - ПеречислениеСсылка.бит_фн_СпособыТранспортаОповещений.
//
Функция ОпределитьСпособТранспорта(ТочкаДоставки) Экспорт

	Если ТипЗнч(ТочкаДоставки) = Тип("СправочникСсылка.бит_МобильныеУстройства") Тогда
		
		СпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.PushNotification");
		
	ИначеЕсли ТипЗнч(ТочкаДоставки) = Тип("СправочникСсылка.бит_ЧатыTelegram") Тогда 	
		
		СпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.Telegram");
		
	Иначе	
		
		СпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта");
		
	КонецЕсли; 

	Возврат СпособТранспорта;
	
КонецФункции // ОпределитьСпособДоставки()

// Функция определяет способ транспорта в зависимости от имени обработки.
//
// Параметры:
//   ИмяОбработки - Строка.
//
// Возвращаемое значение:
//  СпособТранспорта - ПеречислениеСсылка.бит_фн_СпособыТранспортаОповещений.
//
Функция ОпределитьСпособТранспортаПоИмениОбработки(ИмяОбработки) Экспорт

	Если ИмяОбработки = "бит_фн_ОбработкаДоставкиОповещенийПушУведомления" Тогда
		
		СпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.PushNotification");
		
	ИначеЕсли ИмяОбработки = "бит_фн_ОбработкаДоставкиОповещенийTelegram" Тогда	
		
		СпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.Telegram");

	ИначеЕсли ИмяОбработки = "бит_фн_ОбработкаДоставкиОповещенийЭлектроннаяПочта1С" Тогда	
		
		СпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта1С");
	
	Иначе	
		
		СпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта");
		
	КонецЕсли; 

	Возврат СпособТранспорта;
	
КонецФункции // ОпределитьСпособДоставки()

#КонецОбласти