////////////////////////////////////////////////////////////////////////////////
// УчетУСНКлиентСервер: процедуры и функции для отражения документов в учете УСН,
// которые могут вызываться как на клиенте в формах документов, так и на сервере
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

///////////////////////////////////////////////////////////////////////////////
// Заполнение данных для УСН в формах документов

// Структура параметров для процедур и функций отражения документов в УСН
//
Функция ПараметрыНастройкиУСН() Экспорт

	Параметры = Новый Структура;
	
	// обязательные
	Параметры.Вставить("ПрименениеУСН",       Ложь);
	Параметры.Вставить("ПрименениеУСНДоходы", Ложь);
	
	// общие - заполняются из свойств объекта и реквизитов формы
	Параметры.Вставить("Дата");
	Параметры.Вставить("ВидОперации");
	Параметры.Вставить("Налог");
	Параметры.Вставить("НалоговыйПериод");
	Параметры.Вставить("Контрагент");
	Параметры.Вставить("ДоговорКонтрагента");
	Параметры.Вставить("СчетУчетаРасчетовСКонтрагентом");
	Параметры.Вставить("ПринятоОт", "");
	Параметры.Вставить("Выдано", "");
	Параметры.Вставить("ВалютаДокумента");
	Параметры.Вставить("СтатьяДвиженияДенежныхСредств");
	Параметры.Вставить("СубконтоДт1");
	Параметры.Вставить("СубконтоКт1");
	Параметры.Вставить("ВалютаРегламентированногоУчета");
	Параметры.Вставить("КурсДокумента", 1);
	Параметры.Вставить("КратностьДокумента", 1);
	
	// специфичные - заполняются явным образом по месту использования
	Параметры.Вставить("НТТПоПродажнымЦенам", Ложь);
	Параметры.Вставить("НТТНаЕНВД",           Ложь);
	
	Параметры.Вставить("ОбязательныеПараметры", "ПрименениеУСН, ПрименениеУСНДоходы");
	
	Возврат Параметры;

КонецФункции

// Возвращает структуру параметров для настройки отражения документа в УСН
// значениями из реквизитов переданной формы и объекта
//
Функция ПараметрыФормыДокументаДляУСН(Форма) Экспорт

	Параметры = ПараметрыНастройкиУСН();
	
	ЗаполнитьЗначенияСвойств(Параметры, Форма); // Параметры из ФО формы
	
	Если НЕ Параметры.ПрименениеУСН Тогда
		Возврат Параметры;
	КонецЕсли; 
	
	Объект = Форма.Объект;
	
	ЗаполнитьЗначенияСвойств(Параметры, Форма.Объект); // Параметры из реквизитов объекта
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПКО.РозничнаяВыручка") Тогда
		Параметры.НТТПоПродажнымЦенам = Объект.ВыручкаСНТТ И Форма.УчетВПродажныхЦенах;
		Параметры.НТТНаЕНВД           = Форма.НТТНаЕНВД;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаПлатежнойКартой.РозничнаяВыручка") Тогда
		Параметры.НТТПоПродажнымЦенам = Форма.УчетВПродажныхЦенах;
		Параметры.НТТНаЕНВД           = Форма.НТТНаЕНВД;
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Возвращает ставки налога УСН, указанные в НК РФ.
// Ставка УСН доходы - п. 1 ст. 346.20 НК РФ.
// Ставка УСН доходы минус расходы - п. 2 ст. 346.20 НК РФ.
// Ставка минимального налога УСН доходы минус расходы - п. 6 ст. 346.18 НК РФ.
//
// Возвращаемое значение:
//  Структура - ставки налогов.
//    * СтавкаУСНДоходы - Число.
//    * СтавкаУСНДоходыМинусРасходы - Число.
//    * СтавкаМинимальногоНалогаУСНДоходыМинусРасходы - Число.
//
Функция НалоговыеСтавкиПоУмолчанию(Период = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СтавкаУСНДоходы", 6);
	Результат.Вставить("СтавкаУСНДоходыМинусРасходы", 15);
	Результат.Вставить("СтавкаМинимальногоНалогаУСНДоходыМинусРасходы", 1);
	
	Возврат Результат;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// Патентная система налогообложения

// Возвращает налоговую ставку по патентной системе налогообложения
//
Функция НалоговаяСтавкаПоПатентнойСистеме(Знач Период = Неопределено) Экспорт 
	
	Возврат 6/100;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// Формирование Книги учета доходов и расходов

Функция ДатаНачалаФормирования4РазделаКУДиР() Экспорт
	
	Возврат Дата(2013, 1, 1);
	
КонецФункции

// Дата, с которой требуется формировать раздел V "Уплаченный торговый сбор" Книги учета доходов и расходов.
//
Функция ДатаНачалаФормирования5РазделаКУДиР() Экспорт
	
	// Приказ Минфина РФ от 07.12.2016 N 227н.
	Возврат Дата(2018, 1, 1);
	
КонецФункции

#КонецОбласти

