// Содержимое модуля отличается в версиях ПРОФ и КОРП

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьУсловноеОформление(Форма) Экспорт
	
	// НадписьГрафикПлатежей
	ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НадписьГрафикПлатежей");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ГрафикПлатежейЗаполнен", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненныйРеквизит);
	
КонецПроцедуры

Процедура ЗаполнитьРассчитатьСуммы(Форма, ПараметрыСтарогоКурса, ПараметрыНовогоКурса, ТабЧасть) Экспорт
	
	Объект = Форма.Объект;
	
	СуммаПлатежаСтарая = Объект.ГрафикПлатежей.Итог("СуммаПлатежа");
	
	Если СуммаПлатежаСтарая > 0 Тогда
		
		ТаблицаГрафикПлатежей = Объект.ГрафикПлатежей.Выгрузить();
		
		СуммыПлатежейСтарые = ТаблицаГрафикПлатежей.ВыгрузитьКолонку("СуммаПлатежа");
		СуммаПлатежаНовая = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
			СуммаПлатежаСтарая, ПараметрыСтарогоКурса, ПараметрыНовогоКурса);
		СуммыПлатежейНовые = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
			СуммаПлатежаНовая, СуммыПлатежейСтарые);
		ТаблицаГрафикПлатежей.ЗагрузитьКолонку(СуммыПлатежейНовые, "СуммаПлатежа");
		
		Объект.ГрафикПлатежей.Загрузить(ТаблицаГрафикПлатежей);
		
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект[ТабЧасть] Цикл
		СтрокаТаблицы.ОценкаБУ = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
			СтрокаТаблицы.ОценкаБУ, ПараметрыСтарогоКурса, ПараметрыНовогоКурса);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
