    
//БИТ Тртилек 20.12.12 В процедуре вызывается форма дозаполнения недостающих настроек МСФО
//МассивНастроек - массив строковых значений настроек
//ИмяГруппы - строковое значение
Процедура ДозаполнитьНедостающиеНастройки(МассивНастроек, ИмяГруппы) Экспорт
	
	АдресТаблицаДоНастроек = бит_му_Общий.ДозаполнитьНедостающиеНастройки(МассивНастроек, ИмяГруппы, Истина);
	
	Если АдресТаблицаДоНастроек <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура("ОткрытаИзОбщегоМодуля, АдресТаблицаДоНастроек, ИмяГруппы", Истина, АдресТаблицаДоНастроек, ИмяГруппы);
		ОткрытьФормуМодально("ОбщаяФорма.бит_му_ФормаДозаполненияНастроек", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры
