////////////////////////////////////////////////////////////////////////////////
// Расширение функционала ОМ.БухгалтерскиеОтчетыВызовСервера
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// См. БухгалтерскиеОтчетыВызовСервера.УстановитьНастройкиПоУмолчанию().
//
Процедура УстановитьНастройкиПоУмолчанию(ФормаОтчета) Экспорт

	Отчет = ФормаОтчета.Отчет;
	ИдентификаторОбъекта = БухгалтерскиеОтчеты.ИмяОтчета(ФормаОтчета);

	Если Отчет.Свойство("ПоказательМУ") Тогда
		Отчет.ПоказательМУ = Истина;
	КонецЕсли;
	
	Если ИдентификаторОбъекта = "бит_ОборотноСальдоваяВедомостьМУ" Тогда
		
		Настройки = Новый Структура();
		
		Настройки.Вставить("Показатели",			Истина);
		Настройки.Вставить("Группировка",			Ложь);
		Настройки.Вставить("РазвернутоеСальдо",		Ложь);
		Настройки.Вставить("Отбор",					Истина);
		Настройки.Вставить("ДополнительныеПоля",	Истина);
		Настройки.Вставить("УсловноеОформление",	Истина);
		
		ФормаОтчета.ЗаполнитьНастройкамиПоУмолчанию(Настройки);
		
	КонецЕсли;

КонецПроцедуры

// См. БухгалтерскиеОтчетыВызовСервера.ИнициализацияФормыОтчета().
// 
Процедура ИнициализацияФормыОтчета(Отчет, РеквизитыФормы, Форма) Экспорт

	Отчет = Форма.Отчет;
	ИдентификаторОбъекта = БухгалтерскиеОтчеты.ИмяОтчета(Форма);

	Если НЕ СтрНачинаетсяС(ИдентификаторОбъекта, "бит_") Тогда
		Возврат;
	КонецЕсли;
	
	Если РеквизитыФормы.Свойство("ОписанияТиповВидовСубконто") Тогда
		Форма.ОписанияТиповВидовСубконто = Новый Структура;
		Форма.ОписанияТиповВидовСубконто.Вставить("Номенклатура"                  , ПланыВидовХарактеристик.бит_ВидыСубконтоДополнительные_2.Номенклатура.ТипЗначения);
		Форма.ОписанияТиповВидовСубконто.Вставить("Склад"                         , ПланыВидовХарактеристик.бит_ВидыСубконтоДополнительные_2.Склады.ТипЗначения);
		Форма.ОписанияТиповВидовСубконто.Вставить("Контрагент"                    , ПланыВидовХарактеристик.бит_ВидыСубконтоДополнительные_2.Контрагенты.ТипЗначения);
		Форма.ОписанияТиповВидовСубконто.Вставить("ДоговорКонтрагента"            , ПланыВидовХарактеристик.бит_ВидыСубконтоДополнительные_2.ДоговорыКонтрагентов.ТипЗначения);
		Форма.ОписанияТиповВидовСубконто.Вставить("Партия"                        , Неопределено);
		// ++ БП 
		Форма.ОписанияТиповВидовСубконто.Вставить("ДокументРасчетовСКонтрагентами", ПланыВидовХарактеристик.бит_ВидыСубконтоДополнительные_2.ДокументыРасчетовСКонтрагентами.ТипЗначения);
		// -- БП 
	КонецЕсли;

КонецПроцедуры
 
#КонецОбласти
