&НаКлиенте
Функция рс_ПолучитьСсылкуПоРасшифровке_Клиент (Расшифровка,АдресРасшифровки) Экспорт
	Возврат рс_Сервер.рс_ПолучитьСсылкуПоРасшифровке_Сервер (Расшифровка,АдресРасшифровки);
КонецФункции	

&НаКлиенте
Функция рс_ПолучитьИмяМенеджера_Клиент (Ссылка) Экспорт
	Возврат рс_Сервер.рс_ПолучитьИмяМенеджера_Сервер(Ссылка);	
КонецФункции	

&НаКлиенте
Функция рс_ПроверитьПоСтруктуреПодчиненности (Ссылка) Экспорт
	Текст = рс_ОбщийМодуль.рс_ТекстПоСтруктуреПодчиненности(Ссылка);
	
	Если Текст = "" Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Ответ = Вопрос(Текст,РежимДиалогаВопрос.ДаНет);
	
	Возврат (Ответ = КодВозвратаДиалога.Да);
КонецФункции	
