&НаСервере
Функция рс_ПолучитьИмяМенеджера_Сервер (Ссылка) Экспорт
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Ссылка)) Тогда 
		Возврат "Документ." + Ссылка.Метаданные().Имя;
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Ссылка)) Тогда
		Возврат "Справочник." + Ссылка.Метаданные().Имя;
	Иначе	
		Возврат "Неизвестно";	
	КонецЕсли;	
КонецФункции		

&НаСервере
Функция рс_ПолучитьСсылкуПоРасшифровке_Сервер (Расшифровка,АдресРасшифровки) Экспорт
	Данные = ПолучитьИзВременногоХранилища(АдресРасшифровки);
	Эл     = Данные.Элементы.Получить(Расшифровка);
	Поля   = Эл.ПолучитьПоля();
	Для Каждого Поле Из Поля Цикл
		Возврат Поле.Значение;
	КонецЦикла;	
КонецФункции	

